[
    {
        "nodeId": 1,
        "dialogue": "Hi! I'm Alex, a virtual assistant, here to help you talk through participating in cancer clinical research. My goal is to give you personalized information to help you understand what clinical research can mean for your cancer journey. Ready to get started?",
        "input": {
            "allowed": false,
            "nextNode": 2
        },
        "options": [
            {
                "optionText": "Let's get started!",
                "nextNode": 2
            }
        ]
    },
    {
        "nodeId": 2,
        "dialogue": "Alright, first, do you have health insurance (including Medicare or Medicaid)?",
        "input": {
            "allowed": false
        },
        "options": [
            {
                "optionText": "Yes.",
                "userInfo": "Has health insurance",
                "nextNode": 3
            },
            {
                "optionText": "No.",
                "userInfo": "Does not have health insurance",
                "nextNode": 4
            },
            {
                "optionText": "Not sure.",
                "userInfo": "Unsure if has health insurance",
                "nextNode": 5
            }
        ]
    },
    {
        "nodeId": 3,
        "dialogue": "That's great you have health insurance or that you have Medicare or Medicaid! This can make participating in a cancer clinical research study easier. Your health insurance may cover routine patient care costs associated with the research study, such as doctor visits, hospital stays, standard cancer treatments, and necessary lab tests. However, research-specific costs—like the study drug, additional tests performed solely for the study, and extra doctor visits required by the study—are often covered by the study’s sponsor (like the university, government, or drug company in charge of the study).",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 6
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 6
            }
        ]
    },
    {
        "nodeId": 4,
        "dialogue": "If you don't have insurance, that's okay! Many study sponsors (like the university, government, or drug company in charge of the study) cover research-related costs, and some may offer help with routine care expenses. Additionally, there are federal programs and resources that might provide support. You can talk to your doctor, the research study coordinator, or social worker to explore available options and ensure you understand any costs involved and what might be covered.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 6
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 6
            }
        ]
    },
    {
        "nodeId": 5,
        "dialogue": "If you aren't sure if you have insurance, that's okay! If you do have insurance, it may cover routine care costs like doctor visits and lab tests, while the research study sponsor (like the university, government, or drug company in charge of the study) often pays for research-specific expenses, such as the study drug. If you don’t have insurance, many studies still cover research-related costs, and there may be programs or resources to help with other expenses.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 6
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 6
            }
        ]
    },
    {
        "nodeId": 6,
        "dialogue": "Alright, next, if you were to join a clinical research study, would you have a preference for what treatment you'd get?",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "I'd prefer the usual, standard treatment for my cancer.",
                "userInfo": "Prefers usual, standard cancer treatment",
                "nextNode": 7
            },
            {
                "optionText": "I'd hope to get the latest, new treatment for my cancer.",
                "userInfo": "Prefers latest, new cancer treatment",
                "nextNode": 8
            },
            {
                "optionText": "It doesn't matter, as long as the treatment works.",
                "userInfo": "Doesn't care what treatment as long as it works",
                "nextNode": 9
            }
        ]
    },
    {
        "nodeId": 7,
        "dialogue": "I see! Like you, many people only want a treatment that has already been tested. And that’s okay. A lot of clinical research relies on randomly deciding your treatment, meaning you wouldn’t get to choose between the new and standard treatment. However, if you really want the standard treatment, observational studies might be worth looking into, since these studies don’t assign any type of treatment, and you may be able to continue getting standard care. Ultimately, all treatments, whether standard or experimental, aim to provide the best outcomes possible for participants.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 10
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 10
            }
        ]
    },
    {
        "nodeId": 8,
        "dialogue": "I see! Like you, many people only want a new type of treatment. A lot of clinical research relies on randomly deciding your treatment, meaning you wouldn’t get to choose between the new or standard treatment. However, if you really want the new treatment, you could look into phase 1 clinical trials, which usually only offer the new treatment in order to determine safety and the correct dosage. These are riskier, but you’d be closely monitored to evaluate how the treatment affects your cancer and to manage side effects. Ultimately, all treatments, whether standard or experimental, aim to provide the best outcomes possible for participants.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 10
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 10
            }
        ]
    },
    {
        "nodeId": 9,
        "dialogue": "I see! It's perfectly understandable to prioritize treatment efficacy over the specific type of treatment you receive. A lot of clinical research relies on randomly deciding your treatment, meaning you wouldn’t get to choose between the standard or new treatment. Ultimately, all treatments, whether standard or experimental, aim to provide the best outcomes possible for participants.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 10
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 10
            }
        ]
    },
    {
        "nodeId": 10,
        "dialogue": "Okay, next question: would you be okay with a computer (instead of your doctor) deciding what treatment you get?",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Yes.",
                "userInfo": "Comfortable with randomization",
                "nextNode": 11
            },
            {
                "optionText": "No.",
                "userInfo": "No",
                "nextNode": 12
            },
            {
                "optionText": "Not sure.",
                "userInfo": "Not sure if comfortable with randomization",
                "nextNode": 12
            }
        ]
    },
    {
        "nodeId": 11,
        "dialogue": "As mentioned before, many clinical research studies randomly decide your treatment, so your doctor doesn’t get to choose. Instead, a computer randomly chooses if you get the new or standard treatment – this is called randomization. Note that placebos (or “sugar pills”) are not commonly used in cancer research since effective treatments exist. You can talk to your doctor about the possible treatments you might get so you feel more comfortable. People like you, who are okay with the randomization process, are more likely to participate in clinical research!",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 13
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 13
            }
        ]
    },
    {
        "nodeId": 12,
        "dialogue": "As mentioned before, many clinical research studies randomly decide your treatment, so your doctor doesn’t get to choose. Instead, a computer randomly chooses if you get the new or standard treatment – this is called randomization. Note that placebos (or “sugar pills”) are not commonly used in cancer research since effective treatments exist. You can talk to your doctor about the possible treatments you might get so you feel more comfortable. If you still aren’t comfortable with a computer deciding your treatment, consider observational studies, which don’t involve randomization or taking any treatment.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 13
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 13
            }
        ]
    },
    {
        "nodeId": 13,
        "dialogue": "Now, do you think your family would be okay with you participating in cancer clinical research?",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Yes, my family would be okay with this.",
                "userInfo": "Family supports their clinical research participation",
                "nextNode": 14
            },
            {
                "optionText": "No, my family would be upset.",
                "userInfo": "Family does not support their clinical research participation",
                "nextNode": 15
            },
            {
                "optionText": "Not sure.",
                "userInfo": "Not sure if family would support their clinical research participation",
                "nextNode": 15
            }
        ]
    },
    {
        "nodeId": 14,
        "dialogue": "Great! Choosing to be in a study is an important decision and you should talk about it with your family and friends. They may find comfort that you’d have access to advanced treatments and get extra attention from medical experts, enhancing your side effect management and overall care. If anyone in your family has any questions about clinical research your doctor (or someone on the study team) can help. People like you, who have family support, tend to be more likely to join clinical research studies!",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 16
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 16
            }
        ]
    },
    {
        "nodeId": 15,
        "dialogue": "I see. Choosing to be in a study is an important decision and you should talk about it with your family and friends. They may find comfort that you’d have access to advanced treatments and even get extra attention from medical experts, enhancing your side effect management and overall care. Your doctor and the members of the study team can help answer any questions your family members have. When everyone in your family is comfortable with your decision, it can make being in a study a little easier.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 16
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 16
            }
        ]
    },
    {
        "nodeId": 16,
        "dialogue": "Moving on, do you generally trust doctors and researchers who do cancer research?",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Yes, I trust doctors and researchers.",
                "userInfo": "Trusts doctors and researchers",
                "nextNode": 17
            },
            {
                "optionText": "No, I do not trust doctors and researchers.",
                "userInfo": "Does not trust doctors and researchers",
                "nextNode": 18
            },
            {
                "optionText": "Not sure.",
                "userInfo": "Not sure if trusts doctors and researchers",
                "nextNode": 18
            }
        ]
    },
    {
        "nodeId": 17,
        "dialogue": "That's great! Deciding to join clinical research may be affected by how you feel about doctors and researchers, and trusting them makes it easier! It’s good to know that research studies are strictly evaluated and approved by an ethics board made up of not only scientists, but community members too. And it doesn’t stop there. During your participation, a safety board closely monitors you and can adjust or stop the study if needed. You can also choose to leave at any time! Ultimately, the priority of clinical research is to advance cancer treatment for people like you while providing the best, most ethical care!",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 19
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 19
            }
        ]
    },
    {
        "nodeId": 18,
        "dialogue": "That's okay -- deciding to join clinical research may be affected by how you feel about doctors and researchers, and mistrust can make it hard. It may be helpful for you to know that research studies are strictly evaluated and approved by an ethics board made up of not only scientists, but community members too. And it doesn’t stop there. During your participation, a safety board closely monitors you and can adjust or stop the study if needed. You can also choose to leave at any time! Ultimately, the priority of clinical research is to advance cancer treatment for people like you while providing the best, most ethical care!",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 19
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 19
            }
        ]
    },
    {
        "nodeId": 19,
        "dialogue": "Finally, is it important to you to help others who might be affected with your type of cancer in the future?",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Yes, I want to help others by participating in research.",
                "userInfo": "Wants to help others by being in research",
                "nextNode": 20
            },
            {
                "optionText": "No, helping others is not a priority for me.",
                "userInfo": "Helping others not a priority for being in research",
                "nextNode": 21
            },
            {
                "optionText": "Not sure.",
                "userInfo": "Not sure if helping others is a priority for being in research",
                "nextNode": 22
            }
        ]
    },
    {
        "nodeId": 20,
        "dialogue": "Like you, many people participate in cancer research to improve cancer care for others! Your participation not only aids researchers in understanding the disease better but also helps future patients benefit from improved therapies and care options. People also join because they want a chance to receive the newest treatment or get extra care from the clinical research staff. People like you, who join to help others, are more likely to join cancer research!",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 23
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 23
            }
        ]
    },
    {
        "nodeId": 21,
        "dialogue": "Of course, your choice should be based on your personal values as well as the facts about clinical research. In addition to helping others, clinical research can offer great opportunities for you as an individual. For example, you’d have the chance to try a new treatment, and you’d get extra attention from the clinical research staff in addition to your current care.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 23
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 23
            }
        ]
    },
    {
        "nodeId": 22,
        "dialogue": "Helping others by helping develop new cancer treatments is one reason why many people join clinical trials, but others join for personal benefits. For example, you’d have the chance to try a new treatment, and you’d get extra attention from the clinical research staff in addition to your current care. Ultimately, your choice should be based on your personal values as well as the facts about clinical research.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "response": {
            "alterDialogue": true
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 23
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 23
            }
        ]
    },
    {
        "nodeId": 23,
        "dialogue": "Okay, thanks for chatting with me today! That's all the topics I wanted to talk about. If you have anymore questions, feel free to ask, or you can click the 'End Conversation' button on the right of your screen.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "I have more questions.",
                "nextNode": 99,
                "continueNode": "23"
            }
        ]
    },
    {
        "nodeId": 99,
        "dialogue": "I see you have more questions! Please type your question below.",
        "input": {
            "allowed": true,
            "nextNode": 100
        }
    },
    {
        "nodeId": 100,
        "dialogue": "If you have more questions, please type your question below. Or, you can click 'I'm done' to continue our conversation.",
        "input": {
            "allowed": true,
            "nextNode": 100
        },
        "response": {
            "alterDialogue": false
        },
        "options": [
            {
                "optionText": "I'm done."
            }
        ]
    }
]