[
    {
        "nodeId": 1,
        "dialogue": "Hi! I'm Alex, a virtual assistant, here to talk about participating in cancer clinical research. My goal is to give you information to help you understand what clinical research can mean during the cancer journey. Ready to get started?",
        "input": {
            "allowed": false,
            "nextNode": 2
        },
        "options": [
            {
                "optionText": "Let's get started!",
                "nextNode": 2
            }
        ]
    },
    {
        "nodeId": 2,
        "dialogue": "Alright, first we will discuss health insurance. Having health insurance (including Medicare or Medicaid) makes participating in a cancer clinical research study easier. Insurance usually covers most medical treatment costs. Additionally, the study sponsor (like the university, government, or drug company in charge of the study) can help cover costs. If you don't have insurance, there are clinical research studies out there whose study sponsor covers all costs. Also, the National Cancer Institute Community Oncology Research Program has studies for people with lower income, and could be a good option.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 3
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 3
            }
        ]
    },
    {
        "nodeId": 3,
        "dialogue": "Next, let’s talk about treatment during clinical trials. A lot of clinical research relies on randomly deciding the treatment, meaning you wouldn’t get to choose if you get the standard or new treatment. If you prefer the standard treatment, there are research studies that don’t offer treatment, so you might be able to continue standard care. If you want the new treatment, there are research studies that only offer the latest treatment, although these studies have higher risks involved.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 4
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 4
            }
        ]
    },
    {
        "nodeId": 4,
        "dialogue": "Now, it’s important to understand that many clinical research studies use a computer to randomly decide your treatment, so your doctor doesn’t get to choose – this is called randomization. Your doctor can talk you through the possible treatments you might get so you feel more comfortable. Being okay with randomization increases the likelihood of someone being in clinical research. If you aren’t comfortable with a computer deciding your treatment, there are research studies that don’t involve randomization or taking any treatment.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 5
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 5
            }
        ]
    },
    {
        "nodeId": 5,
        "dialogue": "Moving on, choosing to be in a study is an important decision and you should talk about it with your doctor and family members or friends. If anyone in your family has any questions about clinical trials your doctor (or someone on the study team) can help. When everyone in your family is comfortable with your decision, it can make being in a study a little easier. If your family is already on board with you being in clinical research, that helps make participation smoother.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 6
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 6
            }
        ]
    },
    {
        "nodeId": 6,
        "dialogue": "The next topic is about trust – whether or not you decide to join a trial may be affected by how you feel about cancer doctors or researchers. If you generally trust doctors and researchers, this makes participating in clinical research easier. If you have trouble trusting doctors and hospitals that do research, participating in clinical research may be hard. However, there are many ways that patients are protected when they participate in research studies. Giving cancer patients the best, most ethical care is important to doctors and researchers.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 7
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 7
            }
        ]
    },
    {
        "nodeId": 7,
        "dialogue": "Finally, there are many reasons to participate in cancer clinical research. Some people participate in cancer research to improve cancer care for others. People also join because they want a chance to receive the newest treatment or get extra care from the clinical trial staff. Ultimately, the choice should be based on your personal values as well as the facts about clinical research.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "Okay, continue.",
                "nextNode": 8
            },
            {
                "optionText": "Okay, I have more questions.",
                "nextNode": 99,
                "continueNode": 8
            }
        ]
    },
    {
        "nodeId": 8,
        "dialogue": "Okay, thanks for chatting with me today! That's all the topics I wanted to talk about. If you have anymore questions, let me know, or you can click 'I'm Done'.",
        "input": {
            "allowed": false,
            "nextNode": 4
        },
        "options": [
            {
                "optionText": "I'm done."
            },
            {
                "optionText": "I have more questions.",
                "nextNode": 99,
                "continueNode": "8"
            }
        ]
    },
    {
        "nodeId": 99,
        "dialogue": "I see you have more questions! Please click the 'View Resource' button below to see a resource with more information. Otherwise, click 'I'm done' to continue.",
        "input": {
            "allowed": false,
            "nextNode": 100
        },
        "options": [
            {
                "optionText": "View Resource."
            },
            {
                "optionText": "I'm done."
            }
        ]
    }
]